Documents/Отчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Отчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Задания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработанноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеВыполненныхРабот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/НачальнаяСтраница/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетЗадачи.Ссылка.Исполнитель КАК Исполнитель,
		|	НАЧАЛОПЕРИОДА(ОтчетЗадачи.Ссылка.Дата, ДЕНЬ) КАК День,
		|	СУММА(ОтчетЗадачи.Часов) КАК Часов
		|ИЗ
		|	Документ.Отчет.Задачи КАК ОтчетЗадачи
		|ГДЕ
		|	ОтчетЗадачи.Ссылка.Проведен = ИСТИНА
		|	И ОтчетЗадачи.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетЗадачи.Ссылка.Исполнитель,
		|	НАЧАЛОПЕРИОДА(ОтчетЗадачи.Ссылка.Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Дата1", Месяц.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Месяц.ДатаОкончания);
	//Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Таблица.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.День = ВыборкаДетальныеЗаписи.День;
		НоваяСтрока.ЧасовОтработанно = ВыборкаДетальныеЗаписи.Часов;
	КонецЦикла;

КонецПроцедуры
	
&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	МесяцПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Месяц.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Месяц.ДатаОкончания = КонецМесяца(ТекущаяДата());
	//Месяц.Вариант = ВариантСтандартногоПериода.Месяц;
	ОбновитьТаблицу();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтчет(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Документ.Отчет.ФормаОбъекта", П);
	Форма.Открыть(); 

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Справочник.Задача.ФормаОбъекта", П);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОтработанномуВремени(Команда)
	
	П = Новый Структура;
	//П.Вставить("Исполнитель", Поставщик);
	
	Форма = ПолучитьФорму("Обработка.ОтчетПоОтработанномуВремени.Форма.Форма", П);
	Форма.Открыть();
КонецПроцедуры
